# -*- coding: utf-8 -*-
"""
Сохранение данных в файле
Автор: admin

"""
import pandas as pd
import matplotlib 
# Тестовая база
def base1():
    """
    Учебная база данных сотрудников
    Параметров нет
    Возвращает словарь словарей
    Указано количество детей
    Автор: Поляков К. Л. 
    """
    fields = ["имя", "пол", "возраст", "зарплата", "дети", "департамент"]
    surname = ["Иванов", "Сидоров", "Чернова", "Корюшка", "Берг", "Климов"]
    Иванов = ["Павел Иванов", "муж", 42, 30000, 0, "маркетинг"]
    Сидоров = ["Юрий Сидоров", "муж", 32, 35000, 3, "финансы"]
    Чернова = ["Татьяна Чернова", "жен", 53, 40000, 10, "продажи"]
    Корюшка = ["Ирина Корюшка", "жен", 23, 20000, 2, "маркетинг"]
    Берг = ["Игорь Берг", "муж", 33, 25000, 6, "продажи"]
    Климов = ["Андрей Климов", "муж", 60, 60000, 0, "финансы"]
# Создаем список списков
    w1 = [Иванов, Сидоров, Чернова, Корюшка, Берг, Климов]
# Создаем список словарей
    w2 = [dict(zip(fields,x)) for x in w1]
# Создаем словарь словарей
    w3 = dict(zip(surname, w2))
    return w3
Q1 = base1()

print(Q1)

import pprint
pprint.pprint(Q1)

Q1.keys()
Q1.values()

def test(Q1):
    for i in Q1:
        if name=(print(Q1[i]['имя'].split(' ')[0])) print()
        
        
test(Q1)

B1=pd.Series([4,7,-5,3], idnex=['c','d','f','a'])
A=np.array([4,7,-5,3])

B2 = B[['c','d','f','a']]
B2 =['c'] =5
B4=dp.DataFrame(B1)

B3=

